//
//  ScenarioProrerty.swift
//  DefeatAlgebra
//
//  Created by yo hanashima on 2018/08/12.
//  Copyright © 2018 yo hanashima. All rights reserved.
//

import Foundation

// 0: good scientist, 1: mad scientist, 2: main hero

struct ScenarioProperty {
    static let scenario0: [[String]] = [
        ["2", "はっ！ ふっ！ はっ！ はっ！ ふっ！"],
        ["0", "ほっほっほ\n精がでるな'エックス'よ"],
        ["2", "あ、'アルジェ博士'"],
        ["0", "訓練も大事だが\n勉強もサボるんじゃないぞ"],
        ["2", "はいはい、わかってますよ\n(あんなのやっても意味ないだろ..)"],
        ["pause"],
        ["2", "な、なんだ！？"],
        ["1", "はっはっはっ\n久しぶりだな'アルジェ博士'よ"],
        ["0", "お前は、'ジェブラ博士'！"],
        ["2", "知り合いなんですか！？"],
        ["0", "うむ・・。奴はわしの元弟子じゃ。"],
        ["0", "しかし、危険な研究ばかりするゆえ破門にしたのじゃ・・"],
        ["1", "ははは、嘘をつけ。\n私の才能に嫉妬して追い出したんだろう！"],
        ["0", "ばかをいえ・・・\n今ごろ何をしに来たんじゃ！"],
        ["1", "ふふふ。愚かな我が元師匠に私の研究の素晴らしさを教えてやろうと思ってな!"],
        ["1", "ゆけっ！我がロボット達よ！！奴らの町を破壊するのだ！"],
        ["pause"],
        ["2", "なんだこいつらは！？"],
        ["0", "どうやら、あやつが作り出した兵器のようじゃの"],
        ["2", "町を破壊するって言ってたぞ！なんとかしないと！！"],
        ["0", "わしが奴のロボットを分析する！それまで時間を稼いでくれ！"],
        ["2", "時間を稼げって言われても、どうすりゃいいんだ・・"],
        ["pause"],
        ["2", "なんだ！？何か信号みたいなのを送ってるぞ"],
        ["2", "うわっ！腕が伸びた！？あれに当たったらヤバそうだ"],
        ["0", "わかったぞ！こやつらの仕組みが！"],
        ["2", "本当ですか！？博士！"],
        ["0", "うむ。ジェブラ博士が信号を送っていたじゃろう"],
        ["2", "そうそう！なんか黄色い信号があいつからロボットに送られてた！"],
        ["0", "そうじゃ。あのロボットは、送られてきた信号の「回数」と"],
        ["0", "各ロボットにプログラムされている「暗号」に応じて攻撃してくるようじゃ"],
        ["2", "「暗号」？"],
        ["0", "そうじゃ、これが暗号じゃ"],
        ["pause"],
        ["2", "なんかxとか数字が書いてあるな"],
        ["0", "どうやら、xは、信号の回数を表してるようなんじゃ"],
        ["0", "そして、あの暗号と攻撃時のパンチの長さには関係があるようなのじゃが..."],
        ["0", "それ以上はわからん...エックスよ！なんとかその謎を解いて敵を倒してくれ！"],
        ["2", "えーーー、一番肝心なところが分からないのかよ"],
        ["2", "くそぉ。なんとかするしかないか！"],
        ["pause"],
        ["2", "よし！全部やっつけたぞ！"],
        ["1", "ほぅ、なかなかやるようだな"],
        ["1", "だが、我がロボットの恐ろしさはこんなものではないぞ！"],
        ["2", "俺の町を破壊なんかさせないぞ！"],
        ["pause"]
    ]
}
